Revit 2026 API

# ExporterIFCSetFile Method

---

Sets the handle to the IFC file being created during this export operation.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFile(
	IFCFile file
)
```
```vb
Public Sub SetFile (
	file As IFCFile
)
```
```cpp
public:
void SetFile(
	IFCFile^ file
)
```
```fsharp
member SetFile :
        file : IFCFile -> unit
```

#### Parameters

file IFCFile
     The handle to the file.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExporterIFC Class

Autodesk.Revit.DB.IFC Namespace